var kana_data = { "り": ["リンゴ", "リズム", "りょうり", "リンのおやつ", "リコーダー", "リップ", "りっぽうたい", "リーフ", "リング", "リノ", "りゅうきゅうからて", "リン", "リマ"], "あ": ["アップル", "アナナス", "アキノのブローチ", "アロー", "あおいえのぐ", "あまいもの", "アーサー", "あめ", "アイドルのひっすあいてむ", "アンブレラ", "あひる", "アオイのともだち", "アクセサリー", "あかり", "アカリ", "アンナ", "あほのこ", "アヤネ", "アキノ", "アオイ", "アユミ", "あねご", "アリサ"], "き": ["きんだんのかじつ", "きゅうけつき", "キャット", "きんぎょ", "きのみ", "きけんぶつ", "キャルのまどうしょ", "キャロル", "キャンディ", "きらきら", "きずなポイント", "きょほう", "きぬごしどうふ", "きんか", "きんトレ", "キョウカ", "きくうし", "キャル"], "ご": ["ゴリラ", "ごかくけい", "ごれいじょう"], "れ": ["れいちょうるい", "レンズ", "レンズ ", "レター", "レイ", "レイさまファンクラブ", "レジーナゲッシュ", "れちぇるちぇぽぱぴ"], "う": ["うほうほ", "うた", "うさぎ", "うま", "うみ", "うお", "ウルフ", "うた ", "うずしお", "ウェイトトレーニング", "うつくしいボク", "うさぎさんだいすき", "うらないし", "うたひめ"], "ま": ["マスター・ウキキー", "まんげつ", "まもの", "マウス", "マツリのあこがれ", "マルジェンかいがん", "まぐろ", "マグ", "マイク", "マネー", "マッスル", "マコトのおさななじみ", "マツリ", "マホ", "まほうしょうじょ", "ママ", "マヒル", "マコト", "マッドサイエンティスト"], "ら": ["ラッパ", "らんちゅう", "ラット", "ラビット", "ランドソルのかたち", "ライブ", "ライスケーキ", "ラブレター"], "と": ["トランペット", "とびどうぐ", "とり", "とらねこ", "とりのす", "とら", "とびどうぐ ", "とうふ", "とり", "とんぼ", "とーごくぶんか", "トーゴクかぶれ", "トモ"], "か": ["かんがっき", "カリンのめがね", "かわぐつ", "カカオ", "かぐ", "かいがん", "かいがら", "かんがっき ", "かつお", "かなづち", "カップ", "かがみもち", "かさ", "かね", "カレー", "カスミ", "カリスマモデル", "カオリ", "かんぶ", "カヤ"], "ぱ": ["パイナップル", "ぱかぱか", "パラソル"], "る": ["ルビー", "ルーペ", "ルナ", "ルージュ", "ルピ", "ルカのしゅみごと", "ルカ"], "ほ": ["ほうせき", "ほねつきにく", "ホース", "ほん", "ほし", "ほっとけないよ", "ほいくえんのせんせい", "ホマレ"], "が": ["ガーネット", "がちょう", "ガード", "ガイドやく"], "じ": ["ジュエリー", "ジョッキ", "ジズ", "ジャム", "じょうば", "ジュン", "ジータ"], "こ": ["こうきせきウィスタリア", "こうもり", "こども", "こだますいか", "こうかくるい", "こづち", "コーヒー", "このは", "こぜに", "こめ", "こうじょう", "こうえんあそび", "こあくま", "こうりつちゅう", "コッコロ"], "び": ["ビールっぽいもの", "ビンぞこめがね", "ビーチ", "ビービーだんのメンバー"], "む": ["むぎしゅわ", "むしめがね", "ムーン", "むてきヒーロートラタイガー", "ムーバ", "むぎ", "むてき", "ムイミ"], "え": ["エターナルジョッキ", "えのぐ", "エッグ", "エリザベス", "エクスタシー", "エリコ", "えせニンジャ", "エルフのおんな"], "ゆ": ["ゆみや", "ゆびわ", "ゆうぐ", "ゆうれい", "ユイ", "ゆうれい ", "ユキ", "ユカリ", "ゆうとうせい", "ユイのおさななじみ", "ユニ"], "ぼ": ["ボウ", "ボム", "ぼうきゃくのキャロル", "ぼうし", "ぼうぐ", "ぼくじょうぬし", "ぼっち"], "お": ["おんぷ", "おさかな", "おちち", "おかし", "おさかな ", "おおかみ", "おかし ", "おもち", "おたより", "オニヤンマ", "おかね", "おこめ", "おなべ", "おしゅうじ", "おばけ", "おひめさま", "おっちょこちょい", "おわらいのみち", "おねえちゃんだよ", "おとなのレディ", "おこちゃま", "おうけのそうび"], "み": ["ミュージック", "ミート", "ミルク", "ミソギのいたずらグッズ", "ミックスベリーケーキ", "ミヤコのおやつ", "ミヤコ", "ミソギ", "ミヤコ ", "ミサト", "ミミ", "ミクマりゅう", "ミフユ", "ミサキ", "ミツキ", "みこ"], "ど": ["ドレミ", "ドラゴンのにく", "ドラちゃんのこうぶつ", "どんぐり", "ドッグ", "ドラゴンフライ", "ドえむ", "ドラゴンブレス"], "ち": ["チューブ", "ちゅーちゅー", "チョコレート", "チェア", "ちょうみりょう", "ちょうみりょう ", "ちゅうにびょう", "ちょうのうりょくしょうじょ", "ちゃんイオ", "チカ", "チエル"], "ぶ": ["ブルー", "ブーツ", "ブック", "ブリリアントマイク", "ブドウ", "ぶんしんたい"], "け": ["けん", "けもの", "ケーキ"], "そ": ["ソード", "ソイソース", "ソルト"], "つ": ["つるぎ", "つき", "ツリー", "つな", "つりざお", "ツムギ", "ツンデレ"], "は": ["はもの", "はんせん", "ハーミットナイト", "ハンマー", "ハット", "はた", "はっぱ", "ハツネ", "ハイタ～イ", "ハツネちゃんのいもうと"], "ぷ": ["プリンセスソード", "プリンアラモード", "プリンだいすき", "ぷうきちのパートナー", "プリンセス"], "め": ["めがね", "めいげつ", "メール", "メリーさんのひつじ", "めいたんてい", "めいじょゆう", "メイド", "メタモルレグナント"], "ぐ": ["ぐるぐるめがね", "グレープ", "グース", "ぐるぐる", "ぐうたら"], "ず": ["ズーム", "ズック", "ずけい", "ずんどう"], "た": ["たんていのひっすアイテム", "タマキのおともだち", "たまご", "タイガー", "たてぶえ", "たんすいかぶつ", "たて", "たんぼ", "たいやきこうじょう", "たんてい", "タマキ"], "で": ["ディテクティブルーペ", "デラウェア", "デザート", "デストロイヤー", "でんせつのバンパイア"], "に": ["にく", "にゃんこ", "にんぎょう", "ニノン"], "ば": ["バット", "バード", "ばくだん", "バックラー", "バンパイア"], "い": ["イリヤのけんぞく", "いちご", "いす", "イノリのえもの", "いぬ", "インフェルノシールド", "いなほ", "いたずらっこ", "いもうと", "イオ", "イリヤ", "イノリ"], "く": ["くつ", "クルージング", "クリスマス", "クロエのおやつ", "くちべに", "くさ", "クウカのまるひアイテム", "くびかざり", "くるりんぱ", "クルミ", "クウカ", "くいしんぼう", "クリスティーナ", "クロエ"], "し": ["シューズ", "シップ", "しおさい", "しょうせつ", "シルクハット", "シープ", "シールド", "しょうゆ", "シャンデリア", "しお", "シチュー", "シーソー", "しょどう", "しっぷうのヘカーテ", "シオリンのあね", "しんまいきょうし", "シャイ", "シノブ", "シオリ", "しょうかんじゅつし", "ししょう", "シズル"], "ね": ["ねこ", "ねずみ", "ねこ ", "ネビア", "ネックレス", "ネコむすめ", "ネネカ"], "さ": ["さかな", "サラブレッド", "さかな ", "さいころ", "サイカワ", "サレン"], "ふ": ["ふね", "ふえ", "フィッシュ", "フラッグ", "フェアリー", "ファクトリー", "ふで", "ふたごのあね", "ファントムキャッツ", "ふくだんちょう"], "ぎ": ["ぎゅうにゅう", "ギルドハウスアイテム", "ぎふと", "ギャンブル", "ギルドハウスかぐこうにゅう", "ぎったんばっこん", "ギャル", "ギャングのボス"], "な": ["ナッツ", "なつのふうぶつし", "なわ", "なべ", "ナルシスト", "ナナカ"], "す": ["ストロベリー", "すいか", "すなはま", "スター", "すごろく", "スイーツ", "すずり", "スヤスヤ", "スズナ", "スズメ"], "ぬ": ["ぬいぐるみ"], "ろ": ["ろば", "ロリポップ", "ロープ", "ロッド"], "や": ["やどかり", "やまたかぼう", "やんま", "ヤバイですね", "ヤバイわよ"], "の": ["ノート", "ノゾミ", "のんべえ", "ノウェム", "のうきんケンカバカ"], "も": ["もみのき", "もち", "もめんどうふ", "もうひつ", "もふもふ", "モニカ", "モブ", "もりばんみならい"], "ぴ": ["ピコピコハンマー"], "ひ": ["ひとで", "ひがさ", "ひつじ", "ひややっこ", "ひも", "ヒヨリ", "ヒールオール", "ヒーローみならい", "ひきこもり"], "わ": ["わんこ", "わっか", "ワンアイドデビル"], "よ": ["ようせい", "ヨリのいもうと", "ヨリ", "よるをすべるもの"], "ぺ": ["ペコリーヌサマー", "ペンダント", "ペコリーヌ"], "だ": ["ダイス", "ダック", "ダンベル", "だいにんきアイドル", "だんちょう", "ダウナー"], "て": ["てがみ", "てんさいゲーマー", "テーラー", "テレじょのやべーやつ", "テレじょのやべーやつ ", "テレじょのやべーやつ  "], "べ": ["ベルトコンベア"] };
var word_data = { "リンゴ": ["10001", 1], "アップル": ["10001", 2], "きんだんのかじつ": ["10001", 3], "ゴリラ": ["10002", 4], "れいちょうるい": ["10002", 5], "うほうほ": ["10002", 6], "マスター・ウキキー": ["10002", 7], "ラッパ": ["10003", 8], "トランペット": ["10003", 9], "
                 ": ["10003", 10], "パイナップル": ["10004", 11], "アナナス": ["10004", 12], "ルビー": ["10005", 13], "ほうせき": ["10005", 14], "ガーネット": ["10005", 15], "ジュエリー": ["10005", 16], "アキノのブローチ": ["10005", 17], "こうきせきウィスタリア": ["10005", 18], "ビールっぽいもの": ["10006", 19], "ジョッキ": ["10006", 20], "むぎしゅわ": ["10006", 21], "エターナルジョッキ": ["10006", 22], "ゆみや": ["10007", 23], "とびどうぐ": ["10007", 24], "アロー": ["10007", 25], "ボウ": ["10007", 26], "おんぷ": ["10008", 27], "リズム": ["10008", 28], "ミュージック": ["10008", 29], "うた": ["10008", 30], "ドレミ": ["10008", 31], "えのぐ": ["10009", 32], "チューブ": ["10009", 33], "ブルー": ["10009", 34], "あおいえのぐ": ["10009", 35], "けん": ["10010", 36], "ソード": ["10010", 37], "つるぎ": ["10010", 38], "はもの": ["10010", 39], "プリンセスソード": ["10010", 40], "めがね": ["10011", 41], "レンズ": ["10011", 42], "ビンぞこめがね": ["10011", 43], "ぐるぐるめがね": ["10011", 44], "カリンのめがね": ["10011", 45], "むしめがね": ["10012", 46], "レンズ ": ["10012", 47], "ルーペ": ["10012", 48], "ズーム": ["10012", 49], "たんていのひっすアイテム": ["10012", 50], "ディテクティブルーペ": ["10012", 51], "にく": ["10013", 52], "りょうり": ["10013", 53], "ミート": ["10013", 54], "ほねつきにく": ["10013", 55], "ドラゴンのにく": ["10013", 56], "つき": ["10014", 57], "まんげつ": ["10014", 58], "ムーン": ["10014", 59], "ルナ": ["10014", 60], "めいげつ": ["10014", 61], "こうもり": ["10015", 62], "バット": ["10015", 63], "きゅうけつき": ["10015", 64], "イリヤのけんぞく": ["10015", 65], "とり": ["10016", 66], "まもの": ["10016", 67], "バード": ["10016", 68], "ジズ": ["10016", 69], "くつ": ["10017", 70], "ズック": ["10017", 71], "シューズ": ["10017", 72], "かわぐつ": ["10017", 73], "ブーツ": ["10017", 74], "ねこ": ["10018", 75], "キャット": ["10018", 76], "とらねこ": ["10018", 77], "にゃんこ": ["10018", 78], "タマキのおともだち": ["10018", 79], "きんぎょ": ["10019", 80], "おさかな": ["10019", 81], "さかな": ["10019", 82], "らんちゅう": ["10019", 83], "ねずみ": ["10020", 84], "マウス": ["10020", 85], "ちゅーちゅー": ["10020", 86], "ラット": ["10020", 87], "たまご": ["10021", 88], "エッグ": ["10021", 89], "こども": ["10021", 90], "とりのす": ["10021", 91], "ふね": ["10022", 92], "クルージング": ["10022", 93], "はんせん": ["10022", 94], "シップ": ["10022", 95], "ぎゅうにゅう": ["10023", 96], "ミルク": ["10023", 97], "おちち": ["10023", 98], "エリザベス": ["10023", 99], "チョコレート": ["10024", 100], "おかし": ["10024", 101], "あまいもの": ["10024", 102], "カカオ": ["10024", 103], "ドラちゃんのこうぶつ": ["10024", 104], "どんぐり": ["10025", 105], "きのみ": ["10025", 106], "ナッツ": ["10025", 107], "リンのおやつ": ["10025", 108], "いちご": ["10026", 109], "ストロベリー": ["10026", 110], "ジャム": ["10026", 111], "とら": ["10027", 112], "タイガー": ["10027", 113], "ねこ ": ["10027", 114], "けもの": ["10027", 115], "マツリのあこがれ": ["10027", 116], "むてきヒーロートラタイガー": ["10027", 117], "ぬいぐるみ": ["10028", 118], "うさぎ": ["10028", 119], "にんぎょう": ["10028", 120], "ラビット": ["10028", 121], "アーサー": ["10028", 122], "ばくだん": ["10029", 123], "ボム": ["10029", 124], "きけんぶつ": ["10029", 125], "とびどうぐ ": ["10029", 126], "ミソギのいたずらグッズ": ["10029", 127], "すいか": ["10030", 128], "こだますいか": ["10030", 129], "なつのふうぶつし": ["10030", 130], "うま": ["10031", 131], "ろば": ["10031", 132], "ホース": ["10031", 133], "ぱかぱか": ["10031", 134], "サラブレッド": ["10031", 135], "ムーバ": ["10031", 136], "いす": ["10032", 137], "かぐ": ["10032", 138], "チェア": ["10032", 139], "ギルドハウスアイテム": ["10032", 140], "うみ": ["10033", 141], "かいがん": ["10033", 142], "ビーチ": ["10033", 143], "しおさい": ["10033", 144], "すなはま": ["10033", 145], "マルジェンかいがん": ["10033", 146], "やどかり": ["10034", 147], "かいがら": ["10034", 148], "こうかくるい": ["10034", 149], "ハーミットナイト": ["10034", 150], "ふえ": ["10035", 151], "リコーダー": ["10035", 152], "かんがっき ": ["10035", 153], "たてぶえ": ["10035", 154], "ほん": ["10036", 155], "ノート": ["10036", 156], "しょうせつ": ["10036", 157], "ブック": ["10036", 158], "キャルのまどうしょ": ["10036", 159], "さかな ": ["10037", 160], "おさかな ": ["10037", 161], "かつお": ["10037", 162], "まぐろ": ["10037", 163], "フィッシュ": ["10037", 164], "うお": ["10037", 165], "ツリー": ["10038", 166], "クリスマス": ["10038", 167], "もみのき": ["10038", 168], "キャロル": ["10038", 169], "ぼうきゃくのキャロル": ["10038", 170], "あめ": ["10039", 171], "キャンディ": ["10039", 172], "ロリポップ": ["10039", 173], "クロエのおやつ": ["10039", 174], "ハンマー": ["10040", 175], "ピコピコハンマー": ["10040", 176], "かなづち": ["10040", 177], "こづち": ["10040", 178], "イノリのえもの": ["10040", 179], "ほし": ["10041", 180], "ごかくけい": ["10041", 181], "スター": ["10041", 182], "ずけい": ["10041", 183], "ひとで": ["10041", 184], "きらきら": ["10041", 185], "ランドソルのかたち": ["10041", 186], "ぼうし": ["10042", 187], "ハット": ["10042", 188], "やまたかぼう": ["10042", 189], "シルクハット": ["10042", 190], "カップ": ["10043", 191], "コーヒー": ["10043", 192], "マグ": ["10043", 193], "いぬ": ["10044", 194], "ドッグ": ["10044", 195], "おおかみ": ["10044", 196], "ウルフ": ["10044", 197], "わんこ": ["10044", 198], "はた": ["10045", 199], "フラッグ": ["10045", 200], "ケーキ": ["10046", 201], "おかし ": ["10046", 202], "ぎふと": ["10046", 203], "きずなポイント": ["10046", 204], "ミックスベリーケーキ": ["10046", 205], "マイク": ["10047", 206], "うた ": ["10047", 207], "ライブ": ["10047", 208], "アイドルのひっすあいてむ": ["10047", 209], "ブリリアントマイク": ["10047", 210], "くちべに": ["10048", 211], "リップ": ["10048", 212], "ルージュ": ["10048", 213], "もち": ["10049", 214], "おもち": ["10049", 215], "かがみもち": ["10049", 216], "たんすいかぶつ": ["10049", 217], "ライスケーキ": ["10049", 218], "ようせい": ["10050", 219], "フェアリー": ["10050", 220], "ネビア": ["10050", 221], "かさ": ["10051", 222], "アンブレラ": ["10051", 223], "パラソル": ["10051", 224], "ひがさ": ["10051", 225], "ペコリーヌサマー": ["10051", 226], "さいころ": ["10052", 227], "ダイス": ["10052", 228], "ギャンブル": ["10052", 229], "りっぽうたい": ["10052", 230], "すごろく": ["10052", 231], "てがみ": ["10053", 232], "レター": ["10053", 233], "メール": ["10053", 234], "おたより": ["10053", 235], "ラブレター": ["10053", 236], "ブドウ": ["10054", 237], "グレープ": ["10054", 238], "きょほう": ["10054", 239], "デラウェア": ["10054", 240], "ひつじ": ["10055", 241], "シープ": ["10055", 242], "メリーさんのひつじ": ["10055", 243], "とうふ": ["10056", 244], "もめんどうふ": ["10056", 245], "きぬごしどうふ": ["10056", 246], "ひややっこ": ["10056", 247], "あひる": ["10057", 248], "がちょう": ["10057", 249], "グース": ["10057", 250], "ダック": ["10057", 251], "とり ": ["10057", 252], "とんぼ": ["10058", 253], "やんま": ["10058", 254], "オニヤンマ": ["10058", 255], "ドラゴンフライ": ["10058", 256], "はっぱ": ["10059", 257], "このは": ["10059", 258], "リーフ": ["10059", 259], "くさ": ["10059", 260], "アオイのともだち": ["10059", 261], "ゆびわ": ["10060", 262], "リング": ["10060", 263], "わっか": ["10060", 264], "なわ": ["10061", 265], "ロープ": ["10061", 266], "ひも": ["10061", 267], "つな": ["10061", 268], "クウカのまるひアイテム": ["10061", 269], "エクスタシー": ["10061", 270], "たて": ["10062", 271], "シールド": ["10062", 272], "ガード": ["10062", 273], "ぼうぐ": ["10062", 274], "バックラー": ["10062", 275], "インフェルノシールド": ["10062", 276], "おかね": ["10063", 277], "かね": ["10063", 278], "マネー": ["10063", 279], "こぜに": ["10063", 280], "きんか": ["10063", 281], "ルピ": ["10063", 282], "ギルドハウスかぐこうにゅう": ["10063", 283], "プリンアラモード": ["10064", 284], "デザート": ["10064", 285], "スイーツ": ["10064", 286], "ミヤコのおやつ": ["10064", 287], "ネックレス": ["10065", 288], "ペンダント": ["10065", 289], "アクセサリー": ["10065", 290], "くびかざり": ["10065", 291], "いなほ": ["10066", 292], "たんぼ": ["10066", 293], "こめ": ["10066", 294], "おこめ": ["10066", 295], "むぎ": ["10066", 296], "しょうゆ": ["10067", 297], "ソイソース": ["10067", 298], "ちょうみりょう": ["10067", 299], "ベルトコンベア": ["10068", 300], "こうじょう": ["10068", 301], "ファクトリー": ["10068", 302], "たいやきこうじょう": ["10068", 303], "シャンデリア": ["10069", 304], "あかり": ["10069", 305], "しお": ["10070", 306], "ソルト": ["10070", 307], "ちょうみりょう ": ["10070", 308], "うずしお": ["10071", 309], "ぐるぐる": ["10071", 310], "つりざお": ["10072", 311], "ロッド": ["10072", 312], "ルカのしゅみごと": ["10072", 313], "なべ": ["10073", 314], "おなべ": ["10073", 315], "ずんどう": ["10073", 316], "カレー": ["10073", 317], "シチュー": ["10073", 318], "シーソー": ["10074", 319], "ゆうぐ": ["10074", 320], "ぎったんばっこん": ["10074", 321], "こうえんあそび": ["10074", 322], "ふで": ["10075", 323], "しょどう": ["10075", 324], "もうひつ": ["10075", 325], "おしゅうじ": ["10075", 326], "すずり": ["10075", 327], "とーごくぶんか": ["10075", 328], "きんトレ": ["10076", 329], "ダンベル": ["10076", 330], "マッスル": ["10076", 331], "ウェイトトレーニング": ["10076", 332], "おばけ": ["10077", 333], "ゆうれい": ["10077", 334], "ミヤコ": ["10077", 335], "むてき": ["10077", 336], "ヒヨリ": ["20001", 337], "ほっとけないよ": ["20001", 338], "ユイ": ["20002", 339], "ヒールオール": ["20002", 340], "マコトのおさななじみ": ["20002", 341], "レイ": ["20003", 342], "じょうば": ["20003", 343], "ミソギ": ["20004", 344], "いたずらっこ": ["20004", 345], "マツリ": ["20005", 346], "ヒーローみならい": ["20005", 347], "アカリ": ["20006", 348], "ヨリのいもうと": ["20006", 349], "こあくま": ["20006", 350], "ミヤコ ": ["20007", 351], "ゆうれい ": ["20007", 352], "プリンだいすき": ["20007", 353], "ユキ": ["20008", 354], "うつくしいボク": ["20008", 355], "ナルシスト": ["20008", 356], "アンナ": ["20009", 357], "しっぷうのヘカーテ": ["20009", 358], "ちゅうにびょう": ["20009", 359], "マホ": ["20010", 360], "おひめさま": ["20010", 361], "くるりんぱ": ["20010", 362], "リノ": ["20011", 363], "いもうと": ["20011", 364], "あほのこ": ["20011", 365], "ハツネ": ["20012", 366], "ちょうのうりょくしょうじょ": ["20012", 367], "スヤスヤ": ["20012", 368], "シオリンのあね": ["20012", 369], "ナナカ": ["20013", 370], "まほうしょうじょ": ["20013", 371], "サイカワ": ["20013", 372], "カスミ": ["20014", 373], "めいたんてい": ["20014", 374], "たんてい": ["20014", 375], "ミサト": ["20015", 376], "ほいくえんのせんせい": ["20015", 377], "スズナ": ["20016", 378], "カリスマモデル": ["20016", 379], "ギャル": ["20016", 380], "カオリ": ["20017", 381], "りゅうきゅうからて": ["20017", 382], "ハイタ～イ": ["20017", 383], "イオ": ["20018", 384], "しんまいきょうし": ["20018", 385], "ちゃんイオ": ["20018", 386], "ミミ": ["20019", 387], "うさぎさんだいすき": ["20019", 388], "クルミ": ["20020", 389], "めいじょゆう": ["20020", 390], "ヨリ": ["20021", 391], "ふたごのあね": ["20021", 392], "シャイ": ["20021", 393], "てんさいゲーマー": ["20021", 394], "アヤネ": ["20022", 395], "ぷうきちのパートナー": ["20022", 396], "スズメ": ["20023", 397], "メイド": ["20023", 398], "おっちょこちょい": ["20023", 399], "リン": ["20024", 400], "ぐうたら": ["20024", 401], "エリコ": ["20025", 402], "デストロイヤー": ["20025", 403], "サレン": ["20026", 404], "ママ": ["20026", 405], "ノゾミ": ["20027", 406], "だいにんきアイドル": ["20027", 407], "ニノン": ["20028", 408], "トーゴクかぶれ": ["20028", 409], "えせニンジャ": ["20028", 410], "シノブ": ["20029", 411], "うらないし": ["20029", 412], "アキノ": ["20030", 413], "ごれいじょう": ["20030", 414], "マヒル": ["20031", 415], "ぼくじょうぬし": ["20031", 416], "おわらいのみち": ["20031", 417], "ユカリ": ["20032", 418], "のんべえ": ["20032", 419], "キョウカ": ["20033", 420], "ゆうとうせい": ["20033", 421], "トモ": ["20034", 422], "ミクマりゅう": ["20034", 423], "シオリ": ["20035", 424], "ハツネちゃんのいもうと": ["20035", 425], "アオイ": ["20036", 426], "ぼっち": ["20036", 427], "ビービーだんのメンバー": ["20036", 428], "チカ": ["20037", 429], "しょうかんじゅつし": ["20037", 430], "うたひめ": ["20037", 431], "マコト": ["20038", 432], "ユイのおさななじみ": ["20038", 433], "イリヤ": ["20039", 434], "バンパイア": ["20039", 435], "でんせつのバンパイア": ["20039", 436], "よるをすべるもの": ["20039", 437], "クウカ": ["20040", 438], "ドえむ": ["20040", 439], "タマキ": ["20041", 440], "ネコむすめ": ["20041", 441], "ファントムキャッツ": ["20041", 442], "ジュン": ["20042", 443], "だんちょう": ["20042", 444], "ミフユ": ["20043", 445], "ししょう": ["20043", 446], "こうりつちゅう": ["20043", 447], "シズル": ["20044", 448], "おねえちゃんだよ": ["20044", 449], "ミサキ": ["20045", 450], "おとなのレディ": ["20045", 451], "ミツキ": ["20046", 452], "マッドサイエンティスト": ["20046", 453], "ワンアイドデビル": ["20046", 454], "リマ": ["20047", 455], "もふもふ": ["20047", 456], "モニカ": ["20048", 457], "おこちゃま": ["20048", 458], "ツムギ": ["20049", 459], "テーラー": ["20049", 460], "レイさまファンクラブ": ["20049", 461], "アユミ": ["20050", 462], "モブ": ["20050", 463], "ルカ": ["20051", 464], "あねご": ["20051", 465], "ジータ": ["20052", 466], "きくうし": ["20052", 467], "ペコリーヌ": ["20053", 468], "くいしんぼう": ["20053", 469], "おうけのそうび": ["20053", 470], "ヤバイですね": ["20053", 471], "プリンセス": ["20053", 472], "コッコロ": ["20054", 473], "ガイドやく": ["20054", 474], "みこ": ["20054", 475], "キャル": ["20055", 476], "ツンデレ": ["20055", 477], "ヤバイわよ": ["20055", 478], "ムイミ": ["20056", 479], "ノウェム": ["20056", 480], "アリサ": ["20057", 481], "エルフのおんな": ["20057", 482], "もりばんみならい": ["20057", 483], "ネネカ": ["20058", 484], "メタモルレグナント": ["20058", 485], "ぶんしんたい": ["20058", 486], "クリスティーナ": ["20059", 487], "レジーナゲッシュ": ["20059", 488], "ふくだんちょう": ["20059", 489], "イノリ": ["20060", 490], "ドラゴンブレス": ["20060", 491], "かんぶ": ["20060", 492], "カヤ": ["20061", 493], "のうきんケンカバカ": ["20061", 494], "ホマレ": ["20062", 495], "ギャングのボス": ["20062", 496], "クロエ": ["20063", 497], "ダウナー": ["20063", 498], "テレじょのやべーやつ": ["20063", 499], "チエル": ["20064", 500], "れちぇるちぇぽぱぴ": ["20064", 501], "テレじょのやべーやつ ": ["20064", 502], "ユニ": ["20065", 503], "ひきこもり": ["20065", 504], "テレじょのやべーやつ  ": ["20065", 505] }
var pic_data = { "00000": [0, 1888, 160, 160], "10001": [1296, 1240, 160, 160], "10002": [1458, 1240, 160, 160], "10003": [1620, 1240, 160, 160], "10004": [1782, 1240, 160, 160], "10005": [810, 1078, 160, 160], "10006": [810, 916, 160, 160], "10007": [810, 592, 160, 160], "10008": [1458, 1078, 160, 160], "10009": [810, 430, 160, 160], "10010": [810, 268, 160, 160], "10011": [810, 106, 160, 160], "10012": [972, 1078, 160, 160], "10013": [1134, 1078, 160, 160], "10014": [1296, 1078, 160, 160], "10015": [1134, 1240, 160, 160], "10016": [810, 754, 160, 160], "10017": [972, 1240, 160, 160], "10018": [1782, 1402, 160, 160], "10019": [1296, 1402, 160, 160], "10020": [1458, 1402, 160, 160], "10021": [1620, 1402, 160, 160], "10022": [810, 1402, 160, 160], "10023": [972, 1402, 160, 160], "10024": [1134, 1402, 160, 160], "10025": [648, 1240, 160, 160], "10026": [648, 106, 160, 160], "10027": [648, 1078, 160, 160], "10028": [648, 916, 160, 160], "10029": [648, 754, 160, 160], "10030": [648, 592, 160, 160], "10031": [648, 430, 160, 160], "10032": [648, 268, 160, 160], "10033": [810, 1240, 160, 160], "10034": [1782, 1078, 160, 160], "10035": [1296, 754, 160, 160], "10036": [972, 916, 160, 160], "10037": [1782, 754, 160, 160], "10038": [1296, 592, 160, 160], "10039": [1296, 430, 160, 160], "10040": [1296, 268, 160, 160], "10041": [1296, 106, 160, 160], "10042": [1458, 592, 160, 160], "10043": [1782, 592, 160, 160], "10044": [1620, 106, 160, 160], "10045": [1458, 430, 160, 160], "10046": [1458, 268, 160, 160], "10047": [1458, 106, 160, 160], "10048": [1620, 430, 160, 160], "10049": [1782, 430, 160, 160], "10050": [1620, 268, 160, 160], "10051": [1620, 754, 160, 160], "10052": [1620, 592, 160, 160], "10053": [1458, 754, 160, 160], "10054": [1296, 916, 160, 160], "10055": [972, 754, 160, 160], "10056": [972, 592, 160, 160], "10057": [972, 430, 160, 160], "10058": [972, 268, 160, 160], "10059": [972, 106, 160, 160], "10060": [1134, 916, 160, 160], "10061": [1458, 916, 160, 160], "10062": [1134, 106, 160, 160], "10063": [1620, 916, 160, 160], "10064": [1782, 916, 160, 160], "10065": [1134, 754, 160, 160], "10066": [1134, 592, 160, 160], "10067": [1134, 430, 160, 160], "10068": [1134, 268, 160, 160], "10069": [648, 1402, 160, 160], "10070": [1620, 1078, 160, 160], "10071": [486, 106, 160, 160], "10072": [324, 1726, 160, 160], "10073": [1296, 1888, 160, 160], "10074": [1458, 1888, 160, 160], "10075": [1620, 1888, 160, 160], "10076": [1782, 1888, 160, 160], "10077": [162, 1726, 160, 160], "20001": [162, 1564, 160, 160], "20002": [162, 1240, 160, 160], "20003": [162, 106, 160, 160], "20004": [162, 1078, 160, 160], "20005": [162, 916, 160, 160], "20006": [162, 754, 160, 160], "20007": [162, 592, 160, 160], "20008": [162, 430, 160, 160], "20009": [162, 268, 160, 160], "20010": [1134, 1888, 160, 160], "20011": [162, 1402, 160, 160], "20012": [972, 1888, 160, 160], "20013": [0, 754, 160, 160], "20014": [0, 1726, 160, 160], "20015": [0, 1564, 160, 160], "20016": [0, 1402, 160, 160], "20017": [0, 1240, 160, 160], "20018": [0, 1078, 160, 160], "20019": [0, 916, 160, 160], "20020": [0, 592, 160, 160], "20021": [648, 1888, 160, 160], "20022": [0, 430, 160, 160], "20023": [0, 268, 160, 160], "20024": [0, 106, 160, 160], "20025": [162, 1888, 160, 160], "20026": [324, 1888, 160, 160], "20027": [486, 1888, 160, 160], "20028": [810, 1888, 160, 160], "20029": [486, 1726, 160, 160], "20030": [324, 268, 160, 160], "20031": [648, 1726, 160, 160], "20032": [648, 1564, 160, 160], "20033": [810, 1564, 160, 160], "20034": [972, 1564, 160, 160], "20035": [1134, 1564, 160, 160], "20036": [1296, 1564, 160, 160], "20037": [1458, 1564, 160, 160], "20038": [1782, 1564, 160, 160], "20039": [486, 430, 160, 160], "20040": [486, 1402, 160, 160], "20041": [486, 1240, 160, 160], "20042": [486, 1078, 160, 160], "20043": [486, 916, 160, 160], "20044": [486, 754, 160, 160], "20045": [486, 592, 160, 160], "20046": [486, 1564, 160, 160], "20047": [1620, 1564, 160, 160], "20048": [324, 106, 160, 160], "20049": [1782, 1726, 160, 160], "20050": [810, 1726, 160, 160], "20051": [972, 1726, 160, 160], "20052": [1134, 1726, 160, 160], "20053": [1296, 1726, 160, 160], "20054": [1458, 1726, 160, 160], "20055": [1620, 1726, 160, 160], "20056": [324, 1564, 160, 160], "20057": [324, 430, 160, 160], "20058": [324, 1402, 160, 160], "20059": [324, 1240, 160, 160], "20060": [324, 1078, 160, 160], "20061": [324, 916, 160, 160], "20062": [324, 754, 160, 160], "20063": [324, 592, 160, 160], "20064": [486, 268, 160, 160], "20065": [1782, 268, 160, 160] };

var hirakana_data = 'あいうえおかきくけこさしすせそたちつてとなにぬねのはひふへほまみむめもやゆよらりるれろわをがぎぐげごばびぶべぼぱぴぷぺぽだぢづでどんじずぞあいうえおやゆよわつあいうえおやゆよわつ'
var katakana_data = 'アイウエオカキクケコサシスセソタチツテトナニヌネノハヒフヘホマミムメモヤユヨラリルレロワヲガギグゲゴバビブベボパピプペポダヂヅデドンジズゾぁぃぅぇぉゃゅょゎっァィゥェォャュョヮッ'

var answers_myself = [];
var answers_opponent = [];

function changeKataToHira(katakana) {
  console.log(katakana_data.length);
  for (var i = 0; i < katakana_data.length; i++) {
    if (katakana == katakana_data[i]) {
      return hirakana_data[i];
    }
  }
  return katakana;
}

function giveAnswer(input, standpoint = 'answer_myself') {
  //kana = input.slice(-1);
  kana = changeKataToHira(input);
  if (!kana_data.hasOwnProperty(kana)) {
    return;
  }
  answer_all = kana_data[kana];
  //answers = [];
  answers_new = [];
  answers_old = [];
  for (var i = 0; len = answer_all.length, i < len; i++) {
    word_name = answer_all[i];
    word = word_data[word_name];
    pic_id = word[0];
    word_id = word[1];
    save_status = savedata[word_id - 1];
    recommend_rate = nextProb(word_name);
    if (recommend_rate != '一个顶俩') {
      recommend_rate = recommend_rate.toFixed(2);
    }
    if (save_status == 1) {
      answers_new.push(new Array(pic_id, word_id, word_name, 'New!', recommend_rate));
    } else {
      answers_old.push(new Array(pic_id, word_id, word_name, 'Old', recommend_rate));
    }
  }

  answers_new = sortArray(answers_new);
  answers_old = sortArray(answers_old);
  var answers = answers_new.concat(answers_old);
  //console.log(answers);
  showAnswer(answers, standpoint);
}

function sortArray(array) {
  var result = array.sort(function (a, b) {
    return b[4] - a[4];
  })
  return result;
}

function showAnswer(answers, standpoint = 'answer_myself') {
  document.getElementById(standpoint).innerHTML = '';
  console.log(answers)
  str = '';
  for (var i = 0; len = answers.length, i < len; i++) {
    var answer = answers[i];
    console.log('answer:' + answer)
    var pic_id = answer[0];
    var word_id = answer[1];
    var word_name = answer[2];
    var answer_attr = answer[3];
    var recommend_rate = answer[4];

    var div1 = document.createElement('div');
    div1.setAttribute('class', 'pic');
    div1.setAttribute('pic-id', pic_id);
    var div2 = document.createElement('div');
    div2.innerHTML = 'No.' + word_id + ' ' + word_name + ' ' + answer_attr + ' 评分: ' + recommend_rate;
    document.getElementById(standpoint).appendChild(div1);
    document.getElementById(standpoint).appendChild(div2);

    var inp = document.createElement('input');
    inp.type = 'button';
    inp.value = '选择';
    inp.onclick = (function (para) {
      var a = para;
      return function () {
        giveMyAnswer(a, standpoint);
      }
    })(answer);
    document.getElementById(standpoint).appendChild(inp);
  }
  console.log('str:' + str);
}

function giveMyAnswer(answer, standpoint = 'answer_myself') {
  var word_name = answer[2];
  var answer_attr = answer[3];
  standpoint = standpoint == 'answer_myself' ? 'answer_opponent' : 'answer_myself';
  itsyourturn(standpoint);
  if (answer_attr == 'New!') {
    console.log('new!:' + word_name)
    btnAdd(word_name);
  }
  var kana_last = getLastKana(word_name);
  var answers = giveAnswer(kana_last, standpoint);
  console.log('answers_givemy:' + answers)
}

function itsyourturn(standpoint = 'answer_myself') {
  var dd_myself = document.getElementById('dd_myself');
  var dd_opponent = document.getElementById('dd_opponent');
  if (standpoint == 'answer_myself') {
    dd_myself.setAttribute('style', 'color:black');
    dd_opponent.setAttribute('style', 'color:white');
  } else {
    dd_myself.setAttribute('style', 'color:white');
    dd_opponent.setAttribute('style', 'color:black');
  }
}

//savearea
var target_word_list = '';
var kana_list = '';
var savedata = [];
var savedata_encoded = '';
var savedata_len = 505;
var savedata_mod = 6;
var savedata_last = savedata_len - parseInt(savedata_len / savedata_mod) * savedata_mod;
var remain_words = [];

function initSaveData(word_status = 0) {
  for (let i = 0; len = savedata_len, i < len; i++) {
    savedata[i] = word_status;
  }
}

function btnInit() {
  var str = document.getElementById('initword').value;
  initSaveData('0');
  target_word_list = str;
  word_id_arr = str.split(' ')
  word_id_arr.map(Number);
  word_id_arr.sort(function (a, b) { return a - b });
  modifySaveData(word_id_arr, '1');
  changeSaveToWords();
  refreshSaveArea();
}

function btnAdd(str = 0) {
  var words = str == 0 ? document.getElementById('addword').value : str;
  word_arr = words.split(' ');
  word_id_arr = [];
  for (var i in word_arr) {
    word = word_arr[i];
    if (word_data.hasOwnProperty(word)) {
      word_id = word_data[word][1];
      console.log('word_id:' + word_id)
      word_id_arr.push(word_id);
    }
  }
  modifySaveData(word_id_arr, '0');
  changeSaveToWords();
  refreshSaveArea();
}

function btnSave() {
  var str = document.getElementById('showword').value;
  savedata_encoded = str;
  savedata = string64to2(str);
  changeSaveToWords();
}

function changeSaveToWords() {
  var words = '';
  remain_words = [];
  var count = 0;
  for (let i = 0; len = savedata.length, i < len; i++) {
    if (savedata[i] == 1) {
      remain_words.push(parseInt(i + 1));
      words = words + (i + 1) + ' ';
      count++;
    }
  }
  console.log('当前剩余未点亮单词数:' + remain_words.length);
  target_word_list = words;
  checkProb();
  refreshSaveArea();
}

function modifySaveData(word_id_arr, word_status) {
  for (let i = 0; len = word_id_arr.length, i < len; i++) {
    word_id = word_id_arr[i];
    savedata[word_id - 1] = word_status;
    console.log('word_id:' + word_id + 'savestatus:' + savedata[word_id - 1])
  }
  showSaveData();
}

function refreshSaveArea() {
  document.getElementById('initword').value = target_word_list;
  document.getElementById('addword').value = kana_list;
  document.getElementById('showword').value = savedata_encoded;
}

function savedataToStr() {
  str = savedata.join('');
  return str;
}

function showSaveData() {
  split_len = 6;
  split_arr = [];
  savestr = savedataToStr();
  for (var i = 0; len = savedata.length, i < len; i += split_len) {
    split_arr.push(savestr.substr(i, split_len));
  }
  savedata_encoded = string2to64(split_arr);
}

function string2to64(numbers) {
  var chars = '0123456789abcdefghigklmnopqrstuvwxyzABCDEFGHIGKLMNOPQRSTUVWXYZ?%'
  var result = '';
  for (var i = 0; len = numbers.length, i < len; i++) {
    num2 = numbers[i];
    num10 = parseInt(num2, 2);
    console.log('num10:' + num10);
    result += chars[num10]
  }
  console.log('result:' + result);
  return result;
}

function string64to2(numbers) {
  var chars = '0123456789abcdefghigklmnopqrstuvwxyzABCDEFGHIGKLMNOPQRSTUVWXYZ?%'
  var result = '';
  for (var i = 0; len = numbers.length, i < len; i++) {
    num10 = chars.indexOf(numbers[i]);
    num2 = num10.toString(2);
    if (i < (len - 1) && num2.length < savedata_mod) {
      let l = num2.length;
      let l_max = i < (len - 1) ? savedata_mod : savedata_last;
      while (l < l_max) {
        num2 = '0' + num2;
        l++;
      }
    }
    result += num2;
  }
  console.log('result:' + result);
  result = result.split('');
  result.map(Number);
  return result;
}

function initPic() {
  str = '';
  for (let i in pic_data) {
    data = pic_data[i];
    pos_left = -(parseInt(data[0])) / 2;
    pos_top = -(parseInt(data[1])) / 2;
    width = parseInt(data[2]) / 2;
    height = parseInt(data[3]) / 2;
    str = str + '[pic-id="' + i + '"]{width:' + width + 'px;height:' + height + 'px;background-position:' + pos_left + 'px ' + pos_top + 'px}\n';
  }
  document.getElementById("pic-style").innerHTML = str;
}

function giveKanaInput(object) {
  var kana = object.value.slice(0,1);
  giveAnswer(kana);
  itsyourturn();
}

//main
initPic();
initSaveData('1');

